In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [3]:
fpd=pd.read_csv('flight_data.csv')

In [4]:
fpd.head()

  source destination     fare
0   Agra      Mumbai  ₹ 7,970
1   Agra      Mumbai  ₹ 7,970
2   Agra      Jaipur      NaN
3   Agra    Varanasi      NaN
4   Agra      Manali      NaN